DataProcessors/ДобавитьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>ДобавитьКлиента</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДобавленныеКлиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ДобавленныеКлиенты</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ДобавитьКлиента/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ДобавитьКлиентаНаСервере(Клиент)
	
	Параметры = КлиентОбменДанными.ПолучитьПараметрыСоединенияСGo();
	Сообщить(КлиентRabbit.СоздатьОбменникRabbit(Параметры, Клиент));
	Сообщить(КлиентRabbit.ОбъявитьОчередьRabbit(Параметры, Клиент));
	Сообщить(КлиентRabbit.ПривязатьОчередьRabbit(Параметры, Клиент, Клиент, Клиент));
	
	НоваяЗапись = РегистрыСведений.ДобавленныеКлиенты.СоздатьМенеджерЗаписи(); 
	НоваяЗапись.Период = ТекущаяДата(); 
	НоваяЗапись.Клиент = Клиент;
	НоваяЗапись.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКлиента(Команда)
	ДобавитьКлиентаНаСервере(НазваниеКлиента);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьКлиентаНаСервере(Клиент)
	
	Параметры = КлиентОбменДанными.ПолучитьПараметрыСоединенияСGo();
	УдаленоУспешно = КлиентRabbit.УдалитьОчередьRabbit(Параметры, Клиент); 
	Сообщить(КлиентRabbit.УдалитьОбменникRabbit(Параметры, Клиент));
	
	Если УдаленоУспешно = "0" Тогда
	
		НаборЗаписей = РегистрыСведений.ДобавленныеКлиенты.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Клиент.Установить(Клиент);
		НаборЗаписей.Прочитать(); 
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура УдалитьКлиента(Команда)
	УдалитьКлиентаНаСервере(НазваниеКлиента);
КонецПроцедуры
